'''
Напишіть програму для обчислення площі та периметра прямокутника.

Молодець, а тепер використайте свій модуль з минулого завдання і 
напишіть програму, яка обчислює спочатку периметр, 
а після - площу прямокутника. Виведіть результат на екран.
'''

# Підключи модуль з попереднього завдання

from math1 import perimeter, area

a = int(input("Введіть першу сторону прямокутника: "))
b = int(input("Введіть другу сторону прямокутника: "))

perimeter_result = perimeter(a, b)
area_result = area(a, b)

print(f"Периметр прямокутника: {perimeter_result}")
print(f"Площа прямокутника: {area_result}")

