'''
Медіана - число, яке ділить ряд чисел на дві рівні частини, 
в одній з яких числа більше медіани, в іншій - менше. 
Давайте напишемо програму, яка виводить медіану трьох чисел!

В основній програмі користувач вводить три числа, 
які передаються в якості параметрів в функцію. 
Функція повинна повернути медіану трьох чисел, 
тобто середнє з цих чисел. 
Наприклад, серед чисел 4, 6, 2 медіаною є число 4. 
Серед чисел 5 4 5 медіаною є 5.
'''

def find_median(x, y, z):
    numbers = [x, y, z]

    numbers.sort()

    return numbers[1]

num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
num3 = float(input("Введіть третє число: "))

print("Медіана:", find_median(num1, num2, num3))
